autopecas/app/controllers/autopecas_controller.rb

  def index
    if params[:pesquisar]
      @autopecas = Autopeca.pesquisar(params[:pesquisar])
    else
        # or, use an explicit "per page" limit:
        #@autopecas = Autopeca.all.paginate(:page => params[:page], :per_page => 10)
      @autopecas = Autopeca.all.paginate(:page => params[:page])
---
SELECT "autopecas".* FROM "autopecas"  WHERE (nome like '%Rolamento%')
SELECT COUNT(*) FROM "autopecas"

  def create
    @autopeca = Autopeca.new(autopeca_params)

    respond_to do |format|
      if @autopeca.save
---
INSERT INTO "autopecas" ("aplicacao", "codigo_peca", "created_at", "estoque", "grupo", "info", "montadora", "nome", "num_fabrica", "pratileira", "updated_at", "valor_compra", "valor_venda") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @autopeca.update(autopeca_params)
---
UPDATE "autopecas" SET "aplicacao" = ?, "updated_at" = ?, "valor_compra" = ?, "valor_venda" = ? WHERE "autopecas"."id" = 2  [["aplicacao", "dfqndpmqsçd"], ["updated_at", "2016-09-26 15:39:59.607163"], ["valor_compra", "R$ 33.700,00"], ["valor_venda", "R$ 3.371.231,23"]]

  def selling
    @autopeca.estoque = @autopeca.estoque - 1
    @autopeca.save
---
UPDATE "autopecas" SET "estoque" = ?, "updated_at" = ? WHERE "autopecas"."id" = 1  [["estoque", 10], ["updated_at", "2016-07-14 04:29:46.150490"]]

  def destroy
    @autopeca.destroy
---
DELETE FROM "autopecas" WHERE "autopecas"."id" = ?  [["id", 30]]

    def set_autopeca
      @autopeca = Autopeca.find(params[:id])
---
SELECT  "autopecas".* FROM "autopecas"  WHERE "autopecas"."id" = ? LIMIT 1  [["id", 30]]