autopecas/app/views/autopecas/selling.js.erb

UPDATE "autopecas" SET "estoque" = ?, "updated_at" = ? WHERE "autopecas"."id" = 1  [["estoque", 10], ["updated_at", "2016-07-14 04:29:46.150490"]]
---
} else {
    <%= @autopeca.update_attribute(:estoque, @autopeca.estoque - 1)%>